# CurveLoop Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop Constructor
CurveLoop Class See Also
---
Constructs a new empty curve loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public CurveLoop()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CurveLoop()
```

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace